In [1]:
import numpy as np
import pandas as pd

In [11]:
x=['a','b','c','d','e','f','g','h','i']
y=[1,2,3,4,5,6,7,8,9]
z={'a':1,'b':2,'c':3,'d':4,'e':5,'f':6,'g':7,'h':8,'i':9,'j':10,
   'k':11,'l':11,'m':13,'n':14,'o':15,'p':16,'q':17,'r':18,'s':19,'t':20,
   'u':21,'v':22,'w':23,'x':24,'y':25,'z':26}

In [16]:
v=pd.Series(x,y)
s=pd.Series(y,x)

In [17]:
v

1    a
2    b
3    c
4    d
5    e
6    f
7    g
8    h
9    i
dtype: object

In [18]:
s

a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8
i    9
dtype: int64

In [26]:
A=[1,2,3,4]
B=[5,6,7,8]
C=[9,10,11,12]
D=[13,12,13,43]
E=[14,324,42,12]

df=pd.DataFrame([A,B,C,D,E],['a','b','c','d','e'],['w','x','y','z'])

In [27]:
df

    w    x   y   z
a   1    2   3   4
b   5    6   7   8
c   9   10  11  12
d  13   12  13  43
e  14  324  42  12

In [30]:
df['Total w+x']=df['w']+df['x']

In [31]:
df

    w    x   y   z  Total  Total w+x
a   1    2   3   4      3          3
b   5    6   7   8     11         11
c   9   10  11  12     19         19
d  13   12  13  43     25         25
e  14  324  42  12    338        338

In [32]:
df['w*z']=df['w']*df['z']

In [33]:
df

    w    x   y   z  Total  Total w+x  w*z
a   1    2   3   4      3          3    4
b   5    6   7   8     11         11   40
c   9   10  11  12     19         19  108
d  13   12  13  43     25         25  559
e  14  324  42  12    338        338  168

In [34]:
df['z/x']=df['z']/df['x']

In [35]:
df

    w    x   y   z  Total  Total w+x  w*z       z/x
a   1    2   3   4      3          3    4  2.000000
b   5    6   7   8     11         11   40  1.333333
c   9   10  11  12     19         19  108  1.200000
d  13   12  13  43     25         25  559  3.583333
e  14  324  42  12    338        338  168  0.037037

In [36]:
df['y-z']=df['y']-df['z']

In [37]:
df

    w    x   y   z  Total  Total w+x  w*z       z/x  y-z
a   1    2   3   4      3          3    4  2.000000   -1
b   5    6   7   8     11         11   40  1.333333   -1
c   9   10  11  12     19         19  108  1.200000   -1
d  13   12  13  43     25         25  559  3.583333  -30
e  14  324  42  12    338        338  168  0.037037   30

In [48]:
df.drop('a')

    w   x   y   z  Total  Total w+x  w*z       z/x  y-z
b   5   6   7   8     11         11   40  1.333333   -1
c   9  10  11  12     19         19  108  1.200000   -1
d  13  12  13  43     25         25  559  3.583333  -30

In [46]:
df

    w   x   y   z  Total  Total w+x  w*z       z/x  y-z
a   1   2   3   4      3          3    4  2.000000   -1
b   5   6   7   8     11         11   40  1.333333   -1
c   9  10  11  12     19         19  108  1.200000   -1
d  13  12  13  43     25         25  559  3.583333  -30

In [44]:
df.drop('e',inplace=True)

In [45]:
df

    w   x   y   z  Total  Total w+x  w*z       z/x  y-z
a   1   2   3   4      3          3    4  2.000000   -1
b   5   6   7   8     11         11   40  1.333333   -1
c   9  10  11  12     19         19  108  1.200000   -1
d  13  12  13  43     25         25  559  3.583333  -30

In [52]:
df.drop('Total',axis=1)

    w   x   y   z  Total w+x  w*z       z/x  y-z
a   1   2   3   4          3    4  2.000000   -1
b   5   6   7   8         11   40  1.333333   -1
c   9  10  11  12         19  108  1.200000   -1
d  13  12  13  43         25  559  3.583333  -30

In [53]:
df.drop('Total',axis=1,inplace=True)

In [54]:
df

    w   x   y   z  Total w+x  w*z       z/x  y-z
a   1   2   3   4          3    4  2.000000   -1
b   5   6   7   8         11   40  1.333333   -1
c   9  10  11  12         19  108  1.200000   -1
d  13  12  13  43         25  559  3.583333  -30

In [58]:
df['w']

a     1
b     5
c     9
d    13
Name: w, dtype: int64

In [72]:
df.loc['c']

w              9.0
x             10.0
y             11.0
z             12.0
Total w+x     19.0
w*z          108.0
z/x            1.2
y-z           -1.0
Name: c, dtype: float64

In [67]:
#addtion of df
g=df.loc['b','w']+df.loc['c','Total w+x']

In [70]:
g

24

In [73]:
df>4

       w      x      y      z  Total w+x    w*z    z/x    y-z
a  False  False  False  False      False  False  False  False
b   True   True   True   True       True   True  False  False
c   True   True   True   True       True   True  False  False
d   True   True   True   True       True   True  False  False

In [75]:
df<2

       w      x      y      z  Total w+x    w*z    z/x   y-z
a   True  False  False  False      False  False  False  True
b  False  False  False  False      False  False   True  True
c  False  False  False  False      False  False   True  True
d  False  False  False  False      False  False  False  True

In [81]:
df[(df['w']>8) & (df['y']>11)]

    w   x   y   z  Total w+x  w*z       z/x  y-z
d  13  12  13  43         25  559  3.583333  -30

In [83]:
df[(df['w']>8) | (df['y']>11)]

    w   x   y   z  Total w+x  w*z       z/x  y-z
c   9  10  11  12         19  108  1.200000   -1
d  13  12  13  43         25  559  3.583333  -30

#pandas Data Analayic tuts

In [89]:
e={'a':[1,2,3,4],'b':[2,4,5,np.nan],'c':[4,1,np.nan,2],'d':[4,2,np.nan,np.nan],'e':[5,np.nan,np.nan,np.nan]}

In [90]:
e

{'a': [1, 2, 3, 4],
 'b': [2, 4, 5, nan],
 'c': [4, 1, nan, 2],
 'd': [4, 2, nan, nan],
 'e': [5, nan, nan, nan]}

In [91]:
e=pd.DataFrame(e)

In [92]:
e

   a    b    c    d    e
0  1  2.0  4.0  4.0  5.0
1  2  4.0  1.0  2.0  NaN
2  3  5.0  NaN  NaN  NaN
3  4  NaN  2.0  NaN  NaN

In [93]:
e.dropna(axis=0)

   a    b    c    d    e
0  1  2.0  4.0  4.0  5.0

In [95]:
e.dropna(axis=1)

   a
0  1
1  2
2  3
3  4

In [96]:
e.dropna(thresh=3)

   a    b    c    d    e
0  1  2.0  4.0  4.0  5.0
1  2  4.0  1.0  2.0  NaN

In [97]:
e.dropna(thresh=5)

   a    b    c    d    e
0  1  2.0  4.0  4.0  5.0

In [101]:
e.dropna(thresh=4)

   a    b    c    d    e
0  1  2.0  4.0  4.0  5.0
1  2  4.0  1.0  2.0  NaN

In [102]:
e.fillna(2)

   a    b    c    d    e
0  1  2.0  4.0  4.0  5.0
1  2  4.0  1.0  2.0  2.0
2  3  5.0  2.0  2.0  2.0
3  4  2.0  2.0  2.0  2.0

In [103]:
e

   a    b    c    d    e
0  1  2.0  4.0  4.0  5.0
1  2  4.0  1.0  2.0  NaN
2  3  5.0  NaN  NaN  NaN
3  4  NaN  2.0  NaN  NaN

In [104]:
e['b']

0    2.0
1    4.0
2    5.0
3    NaN
Name: b, dtype: float64

In [108]:
e['b'].fillna(value=e['b'].mean())

0    2.000000
1    4.000000
2    5.000000
3    3.666667
Name: b, dtype: float64

In [110]:
#mean() the average function
(2+4+5)/3

3.6666666666666665

In [118]:
e.loc[0].fillna(value=e.loc[3].mean(),)

a    1.0
b    2.0
c    4.0
d    4.0
e    5.0
Name: 0, dtype: float64

In [116]:
e

   a    b    c    d    e
0  1  2.0  4.0  4.0  5.0
1  2  4.0  1.0  2.0  NaN
2  3  5.0  NaN  NaN  NaN
3  4  NaN  2.0  NaN  NaN

In [127]:
puu={'item':['apple','apple','bannan','bannan','gunne','gunne','gunne'],'days':['mon','tus','wed','ths','fri','sta','sun'],'sales':[100,23,42,14,13,41,51]}

In [128]:
puu

{'item': ['apple', 'apple', 'bannan', 'bannan', 'gunne', 'gunne', 'gunne'],
 'days': ['mon', 'tus', 'wed', 'ths', 'fri', 'sta', 'sun'],
 'sales': [100, 23, 42, 14, 13, 41, 51]}

In [129]:
p=pd.DataFrame(puu)

In [130]:
p

     item days  sales
0   apple  mon    100
1   apple  tus     23
2  bannan  wed     42
3  bannan  ths     14
4   gunne  fri     13
5   gunne  sta     41
6   gunne  sun     51

In [135]:
x=p.groupby('item')

In [139]:
#mean
x.mean()

        sales
item
apple    61.5
bannan   28.0
gunne    35.0

In [140]:
#standard
x.std()

            sales
item
apple   54.447222
bannan  19.798990
gunne   19.697716

In [141]:
x.count()

        days  sales
item
apple      2      2
bannan     2      2
gunne      3      3

In [142]:
x.max()

       days  sales
item
apple   tus    100
bannan  wed     42
gunne   sun     51

In [143]:
x.min()

       days  sales
item
apple   mon     23
bannan  ths     14
gunne   fri     13

In [144]:
p

     item days  sales
0   apple  mon    100
1   apple  tus     23
2  bannan  wed     42
3  bannan  ths     14
4   gunne  fri     13
5   gunne  sta     41
6   gunne  sun     51

In [152]:
x.describe()

       sales
       count  mean        std   min    25%   50%    75%    max
item
apple    2.0  61.5  54.447222  23.0  42.25  61.5  80.75  100.0
bannan   2.0  28.0  19.798990  14.0  21.00  28.0  35.00   42.0
gunne    3.0  35.0  19.697716  13.0  27.00  41.0  46.00   51.0

In [153]:
x.describe().transpose()

item              apple    bannan      gunne
sales count    2.000000   2.00000   3.000000
      mean    61.500000  28.00000  35.000000
      std     54.447222  19.79899  19.697716
      min     23.000000  14.00000  13.000000
      25%     42.250000  21.00000  27.000000
      50%     61.500000  28.00000  41.000000
      75%     80.750000  35.00000  46.000000
      max    100.000000  42.00000  51.000000

In [178]:
f={'a':[1,2,3],'b':[4,5,6]}
g={'c':[1,2,3],'d':[10,11,12]}

In [179]:
f=pd.DataFrame(f,index=['p1','p2','p3'])

In [190]:
g=pd.DataFrame(g,index=['p4','p5','p6'])

In [191]:
f

    a  b
p1  1  4
p2  2  5
p3  3  6

In [192]:
g

     c   d
p4 NaN NaN
p5 NaN NaN
p6 NaN NaN

In [206]:
f.join(g,how='outer')

      a    b   c   d
p1  1.0  4.0 NaN NaN
p2  2.0  5.0 NaN NaN
p3  3.0  6.0 NaN NaN
p4  NaN  NaN NaN NaN
p5  NaN  NaN NaN NaN
p6  NaN  NaN NaN NaN

In [223]:
a={'a':[1,1,3,4,5],'b':[2,2,4,5,6],'c':[3,3,2,1,3],'e':[4,2,4,3,4],'d':[4,3,4,3,4]}
b={'a':[1,1,1,1,1],'d':[2,2,2,2,2],'f':[3,3,3,3,3],'e':[4,4,4,4,4],'r':[6,6,6,6,6]}
c={'a':[1,1,1,1,1],'b':[2,2,2,2,2],'c':[3,3,3,3,3],'e':[4,4,4,4,4],'d':[4,4,4,4,4]}

In [224]:
a

{'a': [1, 1, 3, 4, 5],
 'b': [2, 2, 4, 5, 6],
 'c': [3, 3, 2, 1, 3],
 'e': [4, 2, 4, 3, 4],
 'd': [4, 3, 4, 3, 4]}

In [225]:
a=pd.DataFrame(a,index=[1,2,3,4,5])
b=pd.DataFrame(b,index=[1,2,3,4,5])
c=pd.DataFrame(c,index=[1,2,3,4,5])

In [226]:
a

   a  b  c  e  d
1  1  2  3  4  4
2  1  2  3  2  3
3  3  4  2  4  4
4  4  5  1  3  3
5  5  6  3  4  4

In [229]:
pd.concat([a,b],axis=1)

   a  b  c  e  d  a  d  f  e  r
1  1  2  3  4  4  1  2  3  4  6
2  1  2  3  2  3  1  2  3  4  6
3  3  4  2  4  4  1  2  3  4  6
4  4  5  1  3  3  1  2  3  4  6
5  5  6  3  4  4  1  2  3  4  6

In [232]:
def inc(x):
    if x>=1:
        x=x+10

In [233]:
a['a'].apply(inc)

1    None
2    None
3    None
4    None
5    None
Name: a, dtype: object